 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x806: file p2original.c, line 25.
(gdb) r
Starting program: /home/runner/pps-IA1-practice-7/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:25
25  {
(gdb) n
27    input(&a,&b,&c);
(gdb) s
input (a=0x7ffc7df6ac48, b=0x7ffc7df6ac4c, c=0x7ffc7df6ac50) at p2original.c:21
21    printf("Enter three numbers\n");
(gdb) n
Enter three numbers
22    scanf("%d%d%d",a,b,c);
(gdb) n
3
4
5
23  }
(gdb) n
main () at p2original.c:28
28    cmp(a,b,c,&large);
(gdb) n
29    printf("%d is the largest of them all\n",large);
(gdb) n
5 is the largest of them all
30    return 0;
(gdb) p a
$1 = 3
(gdb) p b
$2 = 4
(gdb) p c
$3 = 5
(gdb) p large
$4 = 5
(gdb) n
31  }(gdb) q
A debugging session is active.

    Inferior 1 [process 163] will be killed.

Quit anyway? (y or n) y